[
  {
    "id": 0,
    "company": "(주)빅케어",
    "name": "조선일보 건강챌린지",
    "skill": "REACT / TYPESCRIPT",
    "desc": [
      "건강 챌린지에 도전할 수 있는 조선일보 앱 서비스입니다. 인증 사진을 회원들과 공유할 수 있으며, 많은 샐럽과 다양한 기업이 참여했습니다.",
      "React와 Typescript로 전반적인 프론트엔드를 개발했습니다.ㅍ",
      "React-query와 Redux-Toolkit을 사용하여 서버와 클라이언트의 상태 관리를 구분했습니다.",
      "WebView를 기반으로 한 하이브리드 앱으로 제작됐으며, 네이티브 앱과 유사한 사용자 경험을 주기 위해 다양한 페이지 전환 애니메이션을 추가했습니다.",
      "각 네이티브에 앱에 맞는 Bridge 통신을 구현했고, IOS Safe Area에 대응 가능한 화면을 제작했습니다.",
      "불안정한 서버에 대한 사용자 경험 개선 및 향상을 위해 React-query의 query caching과 Accurate Skeleton Loading, Image Preloading를 구현 및 적용했습니다."
    ],
    "link": []
  },
  {
    "id": 1,
    "company": "(주)빅케어",
    "name": "기업검진 관리자",
    "skill": "REACT / TYPESCRIPT / ANT DESIGN",
    "desc": [
      "10개 그룹사 52개의 기업과 전국 122개의 병원을 연결해, 기업직원들의 건강검진 예약을 도와주는 빅케어 기업검진의 관리자 웹 서비스입니다.",
      "React와 Typescript로 전반적인 프론트엔드를 개발했으며 예약 관리, 수검자 관리, 일정 관리, 통계를 담당했습니다.",
      "React-query와 Redux-toolkit을 사용하여 서버와 클라이언트의 상태 관리를 구분하였습니다.",
      "React와 Typescript로 전반적인 프론트엔드를 개발했으며 예약 관리, 수검자 관리, 일정 관리, 통계를 담당했습니다.",
      "React-query의 query caching으로 불필요한 로딩 시간을 줄였으며, API 호출 시 Page와 Filter를 적용시켜 서비스 속도를 개선했습니다."
    ],
    "link": []
  },
  {
    "id": 2,
    "company": "(주)피플아이",
    "name": "피플아이 관리자",
    "skill": "REACT / JAVASCRIPT",
    "desc": [
      "피플아이 전체 서비스의 예약과 결제 그리고 회원 관리를 지원하는 피플아이 관리자 웹 서비스입니다.",
      "React, Javascript로 전반적인 프론트엔드를 개발했으며 실시간 메세지 보내기, 회원 관리, 결제 내역을 담당했습니다.",
      "사용자가 메뉴를 커스텀해서 사용할 수 있도록 Draggable Menu를 구현했습니다.",
      "Python Socketio로 실시간 메세지 보내기 기능을 구현했습니다."
    ],
    "link": []
  },
  {
    "id": 3,
    "company": "(주)피플아이",
    "name": "CATCH ON AI",
    "skill": "REACT / JAVASCRIPT / PYTHON / MYSQL",
    "desc": [
      "조회한 주식 종목의 데이터를 수집 및 분석하여 연관 이슈 및 관련 뉴스를 실시간으로 빠르게 사용자에게 제공하는 웹 서비스입니다.",
      "React, Javascript로 전반적인 프론트엔드를 개발했으며 반응형 웹으로 제작됐습니다.",
      "기업 랭킹, 이슈 모아보기 디자인 작업에 참여했으며, D3의 Graph와 Word Cloud로 정보를 시각화했습니다.",
      "Pyhon을 이용해 회원가입, 로그인, 회원정보수정 등 백엔드 파트를 개발했습니다."
    ],
    "link": []
  }
]
